In [12]:
import pandas as pd

In [13]:
# Series de pandas
numeros = [3, 4, 5, 6, 7]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [14]:
data = {
    "Nombre":["Ana", "Juan", "Pedro", "Maria", "Luis"],
    "Edad":[22, 25, 28 ,23, 20],
    "Ciudad":["Barcelona", "Madrid", "Valencia", "Sevilla", "Bilboa"]
}
data, type(data)

({'Nombre': ['Ana', 'Juan', 'Pedro', 'Maria', 'Luis'],
  'Edad': [22, 25, 28, 23, 20],
  'Ciudad': ['Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Bilboa']},
 dict)

In [15]:
# Generar un dataframe a partir de un diccionario 

df = pd.DataFrame(data=data) 
df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [16]:
# exportar DataFrame 
df.to_csv("data.csv")

In [18]:
# importar un DataFrame
import_df = pd.read_csv("data.csv", index_col=0)
import_df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [19]:
# Seleccionar una columna
nombres = df["Nombre"]
print(nombres, type(nombres))

0      Ana
1     Juan
2    Pedro
3    Maria
4     Luis
Name: Nombre, dtype: object <class 'pandas.core.series.Series'>

In [20]:
# Seleccionar una o mas columnas 
df[["Nombre","Edad"]]

  Nombre  Edad
0    Ana    22
1   Juan    25
2  Pedro    28
3  Maria    23
4   Luis    20

In [21]:
# Filtrar por indice 
fila = df.loc[2]
fila

Nombre       Pedro
Edad            28
Ciudad    Valencia
Name: 2, dtype: object

In [22]:
# Filtrar por condiciones
df[df["Edad"] > 23]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [24]:
filtro = (df["Edad"] > 23) & (df["Nombre"].str.startswith("P"))
df[filtro]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia

In [26]:
# Filtrar por query
df.query("Edad < 23")

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [27]:
df[df["Nombre"].isin(["Ana", "Carlos", "Luis"])]

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
4   Luis    20     Bilboa

In [28]:
def longitud_5(nombre):
    return len(nombre) == 5

df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia
3  Maria    23   Sevilla

In [29]:
# Filtrar por edades entre 25 y 35 a√±os (inclusive)
df[df["Edad"].between(25, 35)]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [32]:
import numpy as np

In [35]:
data = {
    "Nombre":["Ana", "Juan", "Pedro", "Maria", "Luis"],
    "Edad":[22, 25, np.nan ,23, 20],
    "Ciudad":["Barcelona", "Madrid", "Valencia", None, "Bilboa"]
}
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [39]:
# Rellenar los valores faltantes
df_fill = df.fillna(
    {
        "Edad" : df["Edad"].mean(),
        "Ciudad" : "Desconocido"
    }
)
df_fill

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro  22.5     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [ ]:
df_sin_nan = df.dropna()
df_sin_nan